{
  "backend/main.mo": "Backend canister defining mod catalog, user profiles, and library management with access control and seeded mod data.",
  "feature_evidence.json": "Feature-to-file mapping describing implemented features, related components, and test coverage metadata.",
  "frontend-file-summaries.txt": "Human‑written summaries of major frontend files for documentation or build reference.",
  "frontend/index.css": "Global Tailwind-based theme variables and dark mode styles using OKLCH color values.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up global theming and TanStack Router routes for core pages with a shared layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading states and query cache resets.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Popup prompting new authenticated users to set a display name and saving it to the backend.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard that blocks access to protected content and prompts for login.",
  "frontend/src/components/layout/AppHeader.tsx": "Header component with navigation links, logo, login button, and mobile menu toggle.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing header, main content container, and footer with dynamic year and attribution link.",
  "frontend/src/components/mods/ModCard.tsx": "Displays a mod's name, author, version, description, tags, and includes a save button.",
  "frontend/src/components/mods/SaveButton.tsx": "Button to save or remove mods from the user's library with authentication checks and a login prompt.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on user identity and invalidates related queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns the current user identity, authentication state, and profile data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching mods, user library, user profile, and performing library/profile mutations.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme variables and custom styles like arcade glow and borders.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page describing geode+, its features, disclaimer, and underlying technology using styled sections.",
  "frontend/src/pages/ExplorePage.tsx": "Displays a searchable and filterable mod catalog with tag filters, a hero section, and loading states.",
  "frontend/src/pages/ModDetailsPage.tsx": "Shows detailed information for a specific mod including description, tags, external links, and a save button.",
  "frontend/src/pages/MyLibraryPage.tsx": "Displays the user's saved mods with authentication gating, handling empty and loading states.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "JSON describing the current geode+ project state, including version info, required images, existing features, and pending feature requests for an iOS app and backend models."
}